docs: melhora documentação geral
